xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxCan_reg.h
/** \brief AF0, Tx Event FIFO Configuration 2 */
#define CAN1_N2_TX_EFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF0218AF0u)
/** Alias (User Manual Name) for CAN1_N2_TX_EFC.
* To use register names with standard convension, please use CAN1_N2_TX_EFC.
*/
#define CAN1_TXEFC2 (CAN1_N2_TX_EFC)

/** \brief AF4, Tx Event FIFO Status 2 */
#define CAN1_N2_TX_EFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF0218AF4u)
/** Alias (User Manual Name) for CAN1_N2_TX_EFS.
* To use register names with standard convension, please use CAN1_N2_TX_EFS.
*/
#define CAN1_TXEFS2 (CAN1_N2_TX_EFS)

/** \brief AF8, Tx Event FIFO Acknowledge 2 */
#define CAN1_N2_TX_EFA /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF0218AF8u)
/** Alias (User Manual Name) for CAN1_N2_TX_EFA.
* To use register names with standard convension, please use CAN1_N2_TX_EFA.
*/
#define CAN1_TXEFA2 (CAN1_N2_TX_EFA)

/** \brief D00, Access Enable Register CAN Node 3 0 */
#define CAN1_N3_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0218D00u)
/** Alias (User Manual Name) for CAN1_N3_ACCENNODE0.
* To use register names with standard convension, please use CAN1_N3_ACCENNODE0.
*/
#define CAN1_ACCENNODE30 (CAN1_N3_ACCENNODE0)

/** \brief D08, Start Address Node 3 */
#define CAN1_N3_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0218D08u)
/** Alias (User Manual Name) for CAN1_N3_STARTADR.
* To use register names with standard convension, please use CAN1_N3_STARTADR.
*/
#define CAN1_STARTADR3 (CAN1_N3_STARTADR)

/** \brief D0C, End Address Node 3 */
#define CAN1_N3_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF0218D0Cu)
/** Alias (User Manual Name) for CAN1_N3_ENDADR.
* To use register names with standard convension, please use CAN1_N3_ENDADR.
*/
#define CAN1_ENDADR3 (CAN1_N3_ENDADR)

/** \brief D10, Interrupt Signalling Register 3 */
#define CAN1_N3_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0218D10u)
/** Alias (User Manual Name) for CAN1_N3_ISREG.
* To use register names with standard convension, please use CAN1_N3_ISREG.
*/
#define CAN1_ISREG3 (CAN1_N3_ISREG)

/** \brief D14, Interrupt routing for Groups 1 3 */
#define CAN1_N3_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0218D14u)
/** Alias (User Manual Name) for CAN1_N3_GRINT1.
* To use register names with standard convension, please use CAN1_N3_GRINT1.
*/
#define CAN1_GRINT13 (CAN1_N3_GRINT1)

/** \brief D18, Interrupt routing for Groups 2 3 */
#define CAN1_N3_GRINT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT2*)0xF0218D18u)
/** Alias (User Manual Name) for CAN1_N3_GRINT2.
* To use register names with standard convension, please use CAN1_N3_GRINT2.
*/
#define CAN1_GRINT23 (CAN1_N3_GRINT2)

/** \brief D20, Node 3 Timer Clock Control Register */
#define CAN1_N3_NT_CCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0218D20u)
/** Alias (User Manual Name) for CAN1_N3_NT_CCR.
* To use register names with standard convension, please use CAN1_N3_NT_CCR.
*/
#define CAN1_NTCCR3 (CAN1_N3_NT_CCR)

/** \brief D24, Node 3 Timer A Transmit Trigger Register */
#define CAN1_N3_NT_ATTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0218D24u)
/** Alias (User Manual Name) for CAN1_N3_NT_ATTR.
* To use register names with standard convension, please use CAN1_N3_NT_ATTR.
*/
#define CAN1_NTATTR3 (CAN1_N3_NT_ATTR)

/** \brief D28, Node 3 Timer B Transmit Trigger Register */
#define CAN1_N3_NT_BTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0218D28u)
/** Alias (User Manual Name) for CAN1_N3_NT_BTTR.
* To use register names with standard convension, please use CAN1_N3_NT_BTTR.
*/
#define CAN1_NTBTTR3 (CAN1_N3_NT_BTTR)

/** \brief D2C, Node 3 Timer C Transmit Trigger Register */
#define CAN1_N3_NT_CTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF0218D2Cu)
/** Alias (User Manual Name) for CAN1_N3_NT_CTTR.
* To use register names with standard convension, please use CAN1_N3_NT_CTTR.
*/
#define CAN1_NTCTTR3 (CAN1_N3_NT_CTTR)

/** \brief D30, Node 3 Timer Receive Timeout Register */
#define CAN1_N3_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0218D30u)
/** Alias (User Manual Name) for CAN1_N3_NT_RTR.
* To use register names with standard convension, please use CAN1_N3_NT_RTR.
*/
#define CAN1_NTRTR3 (CAN1_N3_NT_RTR)

/** \brief D40, Node 3 Port Control Register */
#define CAN1_N3_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0218D40u)
/** Alias (User Manual Name) for CAN1_N3_NPCR.
* To use register names with standard convension, please use CAN1_N3_NPCR.
*/
#define CAN1_NPCR3 (CAN1_N3_NPCR)

/** \brief E00, Core Release Register 3 */
#define CAN1_N3_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0218E00u)
/** Alias (User Manual Name) for CAN1_N3_CREL.
* To use register names with standard convension, please use CAN1_N3_CREL.
*/
#define CAN1_CREL3 (CAN1_N3_CREL)

/** \brief E04, Endian Register 3 */
#define CAN1_N3_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0218E04u)
/** Alias (User Manual Name) for CAN1_N3_ENDN.
* To use register names with standard convension, please use CAN1_N3_ENDN.
*/
#define CAN1_ENDN3 (CAN1_N3_ENDN)

/** \brief E0C, Data Bit Timing & Prescaler Register 3 */
#define CAN1_N3_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF0218E0Cu)
/** Alias (User Manual Name) for CAN1_N3_DBTP.
* To use register names with standard convension, please use CAN1_N3_DBTP.
*/
#define CAN1_DBTP3 (CAN1_N3_DBTP)

/** \brief E10, Test Register 3 */
#define CAN1_N3_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0218E10u)
/** Alias (User Manual Name) for CAN1_N3_TEST.
* To use register names with standard convension, please use CAN1_N3_TEST.
*/
#define CAN1_TEST3 (CAN1_N3_TEST)

/** \brief E14, RAM Watchdog 3 */
#define CAN1_N3_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0218E14u)
/** Alias (User Manual Name) for CAN1_N3_RWD.
* To use register names with standard convension, please use CAN1_N3_RWD.
*/
#define CAN1_RWD3 (CAN1_N3_RWD)

